{
    "image": [
        "What objects or people are present in the image?",
        "How many people are present in the image?",
        "What colors dominate the scene?",
        "Are there any facial expressions visible (e.g., smiling, frowning)?",
        "What is the general mood conveyed by the scene (e.g., calm, chaotic, festive)?",
        "What is the weather or lighting condition in the image?",
        "Are there any animals or nature elements that might influence sentiment?",
        "What is the general setting of the image (e.g., indoors, outdoors)?",
        "Is there any text visible in the image, and what does it say?",
        "Are there any visible emotions on the people's faces?",
        "What is the dominant color palette of this image?",
        "What is the setting or environment shown in the image?",
        "Are there any visual metaphors or symbols that might convey sentiment?",
        "What relationships can be observed between the objects/people in the image?",
        "What is the overall mood or atmosphere conveyed by this image?",
        "Are there any visual elements that contradict each other in terms of sentiment?",
        "What objects are prominently visible in the image?",
        "Are there any human faces, and what emotions do their expressions convey?",
        "Is the setting indoors or outdoors, and what details describe the environment?",
        "Are there any symbols or logos that might indicate brand associations or cultural context?",
        "What activities or interactions are taking place between objects or people?"
    ],
    "text": [
        "What is the overall sentiment expressed in the text (positive, negative, neutral)?",
        "What are the key entities or topics mentioned in the text?",
        "Which emotional words or phrases are used (e.g., 'happy,' 'angry,' 'sad')?",
        "Is there any sarcasm, irony, or figurative language present?",
        "What context or events are described that might explain the sentiment?",
        "Are there any negations or intensifiers modifying the sentiment (e.g., 'not happy,' 'extremely sad')?",
        "What is the tone of the text (e.g., formal, urgent, playful)?",
        "Are there any cultural references or idioms that affect sentiment interpretation?",
        "Does the text contain any references to emotions (e.g., happy, sad, angry)?",
        "What is the main topic or subject of this text?",
        "What emotional language or affect-bearing words are used?",
        "What is the overall tone of this text (formal, casual, serious, humorous)?",
        "Are there any subjective statements or opinions expressed?",
        "Are there any metaphors, similes, or idioms that convey sentiment?",
        "What rhetorical devices are used that might influence sentiment?",
        "Are there any temporal indicators (past, present, future) relevant to sentiment?",
        "Are there contrasting phrases that might indicate mixed emotions?",
        "What verbs or actions describe relationships between entities?"
    ],
    "audio": [
        "What is the speaker's tone of voice (e.g., cheerful, angry, calm)?",
        "Are there variations in pitch or volume that indicate emotion?",
        "What background sounds or noises are present (e.g., laughter, traffic, silence)?",
        "Is the speech rate fast, slow, or irregular?",
        "Are there pauses, hesitations, or interruptions in the audio?",
        "Does the speaker exhibit signs of stress or excitement in their voice?",
        "Are there any non-verbal sounds (e.g., sighs, laughter, crying)?",
        "What language or dialect is used, and does it influence sentiment expression?",
        "Can you detect any background noise or sounds that could affect sentiment?",
        "What is the speaker's pace of speech (e.g., fast, slow)?",
        "Does the speaker's voice sound calm, stressed, or excited?",
        "Are there any pauses or silences that could imply hesitation or uncertainty?",
        "Can you identify any laughter or crying in the audio?",
        "What emotions are conveyed in the speaker's tone of voice?",
        "What is the actual verbal content of the speech?",
        "Is there music, and if so, what mood does it convey?",
        "What are the key voice characteristics (pitch, volume, pace, rhythm)?",
        "Are there significant pauses or silences, and what might they indicate?",
        "How many speakers are present, and what is their relationship?",
        "What ambient sounds are present and what emotions do they evoke?",
        "Are there any sound effects, and what purpose do they serve?",
        "Does the emotional tone of the audio change over time, and how?",
        "Are there background sounds (e.g., laughter, traffic) that provide contextual clues?",
        "Does the speech rate or pitch vary significantly, and where?",
        "Is the volume consistently loud/soft, or does it fluctuate with emotional intensity?",
        "Are specific words or phrases emphasized through stress or pauses?",
        "Does the audio contain non-verbal cues (e.g., sighs, laughter) that indicate sentiment?"
    ]
}